{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "affected_individuals",
    "1": "infrastructure_and_utility_damage",
    "2": "injured_or_dead_people",
    "3": "missing_or_found_people",
    "4": "not_humanitarian",
    "5": "other_relevant_information",
    "6": "rescue_volunteering_or_donation_effort",
    "7": "vehicle_damage"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "affected_individuals": 0,
    "infrastructure_and_utility_damage": 1,
    "injured_or_dead_people": 2,
    "missing_or_found_people": 3,
    "not_humanitarian": 4,
    "other_relevant_information": 5,
    "rescue_volunteering_or_donation_effort": 6,
    "vehicle_damage": 7
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "transformers_version": "5.0.0.dev0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
